; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	infrared0 - mode
	image3 - mode
	infrared1 - mode
	image4 - mode
	image2 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image2)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(supports instrument2 infrared1)
	(supports instrument2 image3)
	(calibration_target instrument2 Star0)
	(supports instrument3 image3)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared0)
	(supports instrument4 image4)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon3)
	(supports instrument5 image2)
	(supports instrument5 infrared1)
	(supports instrument5 image4)
	(calibration_target instrument5 Star0)
	(supports instrument6 image4)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 infrared0)
	(supports instrument7 image3)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet20)
	(supports instrument8 image4)
	(supports instrument8 image2)
	(supports instrument8 image3)
	(calibration_target instrument8 Star0)
	(supports instrument9 image3)
	(supports instrument9 image4)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 image2)
	(supports instrument10 image4)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument11 infrared1)
	(supports instrument11 image3)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 image2)
	(supports instrument12 image4)
	(calibration_target instrument12 GroundStation1)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(have_image Planet4 image3)
	(have_image Planet5 image4)
	(have_image Phenomenon6 image3)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 image4)
	(have_image Star9 image4)
	(have_image Planet10 image3)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon12 image4)
	(have_image Planet13 image2)
	(have_image Phenomenon14 image3)
	(have_image Planet15 infrared1)
	(have_image Phenomenon16 image4)
	(have_image Phenomenon17 image3)
	(have_image Phenomenon18 image3)
	(have_image Phenomenon19 image4)
	(have_image Planet20 infrared0)
	(have_image Planet21 infrared0)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 18
2. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 18
3. (calibrate satellite3 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 0 of 18
4. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 18
5. (turn_to satellite4 groundstation2 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 groundstation2)
   goals met: 0 of 18
6. (calibrate satellite4 instrument11 groundstation2)
   added: (calibrated instrument11)
   goals met: 0 of 18
7. (turn_to satellite4 phenomenon14 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 phenomenon14)
   goals met: 0 of 18
8. (take_image satellite4 phenomenon14 instrument11 image3)
   added: (have_image phenomenon14 image3)
   goals met: 1 of 18
9. (turn_to satellite4 phenomenon17 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon17)
   goals met: 1 of 18
10. (take_image satellite4 phenomenon17 instrument11 image3)
   added: (have_image phenomenon17 image3)
   goals met: 2 of 18
11. (turn_to satellite4 phenomenon18 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon18)
   goals met: 2 of 18
12. (take_image satellite4 phenomenon18 instrument11 image3)
   added: (have_image phenomenon18 image3)
   goals met: 3 of 18
13. (turn_to satellite4 phenomenon6 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 phenomenon6)
   goals met: 3 of 18
14. (take_image satellite4 phenomenon6 instrument11 image3)
   added: (have_image phenomenon6 image3)
   goals met: 4 of 18
15. (turn_to satellite4 phenomenon7 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon7)
   goals met: 4 of 18
16. (take_image satellite4 phenomenon7 instrument11 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 5 of 18
17. (turn_to satellite4 planet10 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 planet10)
   goals met: 5 of 18
18. (take_image satellite4 planet10 instrument11 image3)
   added: (have_image planet10 image3)
   goals met: 6 of 18
19. (turn_to satellite4 planet15 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet15)
   goals met: 6 of 18
20. (take_image satellite4 planet15 instrument11 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 7 of 18
21. (turn_to satellite4 planet4 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet4)
   goals met: 7 of 18
22. (take_image satellite4 planet4 instrument11 image3)
   added: (have_image planet4 image3)
   goals met: 8 of 18
23. (turn_to satellite3 phenomenon12 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon12)
   goals met: 8 of 18
24. (take_image satellite3 phenomenon12 instrument10 image4)
   added: (have_image phenomenon12 image4)
   goals met: 9 of 18
25. (turn_to satellite3 phenomenon16 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon16)
   goals met: 9 of 18
26. (take_image satellite3 phenomenon16 instrument10 image4)
   added: (have_image phenomenon16 image4)
   goals met: 10 of 18
27. (turn_to satellite3 phenomenon19 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 phenomenon19)
   goals met: 10 of 18
28. (take_image satellite3 phenomenon19 instrument10 image4)
   added: (have_image phenomenon19 image4)
   goals met: 11 of 18
29. (turn_to satellite3 planet13 phenomenon19)
   deleted: (pointing satellite3 phenomenon19)
   added: (pointing satellite3 planet13)
   goals met: 11 of 18
30. (take_image satellite3 planet13 instrument10 image2)
   added: (have_image planet13 image2)
   goals met: 12 of 18
31. (turn_to satellite3 planet5 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet5)
   goals met: 12 of 18
32. (take_image satellite3 planet5 instrument10 image4)
   added: (have_image planet5 image4)
   goals met: 13 of 18
33. (turn_to satellite3 planet8 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 planet8)
   goals met: 13 of 18
34. (take_image satellite3 planet8 instrument10 image4)
   added: (have_image planet8 image4)
   goals met: 14 of 18
35. (turn_to satellite3 star9 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star9)
   goals met: 14 of 18
36. (take_image satellite3 star9 instrument10 image4)
   added: (have_image star9 image4)
   goals met: 15 of 18
37. (turn_to satellite2 groundstation2 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 groundstation2)
   goals met: 15 of 18
38. (calibrate satellite2 instrument7 groundstation2)
   added: (calibrated instrument7)
   goals met: 15 of 18
39. (turn_to satellite2 phenomenon11 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon11)
   goals met: 15 of 18
40. (take_image satellite2 phenomenon11 instrument7 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 16 of 18
41. (turn_to satellite2 planet20 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet20)
   goals met: 16 of 18
42. (take_image satellite2 planet20 instrument7 infrared0)
   added: (have_image planet20 infrared0)
   goals met: 17 of 18
43. (turn_to satellite2 planet21 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 planet21)
   goals met: 17 of 18
44. (take_image satellite2 planet21 instrument7 infrared0)
   added: (have_image planet21 infrared0)
   goals met: 18 of 18
